nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
/*
 Name:		ESP32APRS T-TWR Plus
 Created:	13-10-2023 14:27:23
 Author:	HS5TQA/Atten
 Github:	https://github.com/nakhonthai
 Facebook:	https://www.facebook.com/atten
 Support IS: host:aprs.dprns.com port:14580 or aprs.hs5tqa.ampr.org:14580
 Support IS monitor: http://aprs.dprns.com:14501 or http://aprs.hs5tqa.ampr.org:14501
*/

#include "gui_lcd.h"
#include "esp_adc_cal.h"
#include "AFSK.h"
#include "qrcode.h"

#include <HTTPClient.h>
#include <ESP32httpUpdate.h>
#include "AiEsp32RotaryEncoder.h"

#define SerialLOG Serial

unsigned long dimTimeout = 0;
unsigned long currentTime;
unsigned long loopTime;
int encoder0Pos = 0;
int encoder0PosPrev = 0;
unsigned char encoder_A = 0;
unsigned char encoder_A_prev = 0;
char curTab = 0;
int posNow = 0;
int timeHalfSec = 0;
int line = 16;

uint8_t gps_mode = 0;

#define ROTARY_ENCODER_A_PIN 47
#define ROTARY_ENCODER_B_PIN 46
#define ROTARY_ENCODER_BUTTON_PIN 21

#define ROTARY_ENCODER_STEPS 4
AiEsp32RotaryEncoder rotaryEncoder = AiEsp32RotaryEncoder(ROTARY_ENCODER_A_PIN, ROTARY_ENCODER_B_PIN, ROTARY_ENCODER_BUTTON_PIN, -1, ROTARY_ENCODER_STEPS);

void IRAM_ATTR readEncoderISR()
{
    rotaryEncoder.readEncoder_ISR();
}

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

void MyTextBox::TextBox()
{
    int w = (length * 7) + 4;
    ;
    int char_with = 7;
    int i;
    bool ok = false;
    display.fillRect(x, y, w, 11, BLACK);
    display.drawRect(x, y, w, 11, WHITE);
    curr_cursor = strlen(text);
    if (curr_cursor > 0)
    {
        curr_cursor--;
        encoder0Pos = text[curr_cursor];
    }
    else
    {
        encoder0Pos = 0x30; // 0x20-0x7F
    }

    do
    {
        if (type == 0)
        {
            char_min = 0x20;
            char_max = 0x7F;
        }
        else if (type == 1)
        {
            char_min = 0x2B;
            char_max = 0x39;
        }
        else if (type == 2)
        {
            char_min = 0x41;
            char_max = 0x5A;
        }

        if (encoder0Pos > char_max)
            encoder0Pos = char_min;
        if (encoder0Pos < char_min)
            encoder0Pos = char_max;

        display.fillRect(x + 1, y + 1, w - 2, 9, BLACK);
        for (i = 0; i <= (int)strlen(text); i++)
        {
            if (curr_cursor == i)
            {
                display.fillRect((i * char_with) + x + 1, y, 7, 10, WHITE);
                display.setTextColor(BLACK);
            }
            display.setCursor((i * char_with) + x + 2, y + 2);
            display.print(text[i]);
            display.setTextColor(WHITE);
        }
        text[curr_cursor] = encoder0Pos;
        display.display();
        delay(50);
        if ((digitalRead(keyPush) == LOW))
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                delay(100);
                currentTime = millis();
                while (digitalRead(keyPush) == HIGH)
                {
                    if ((millis() - currentTime) > 1000)
                        break; // OK Timeout
                };
                if ((millis() - currentTime) < 1000)
                { // Duble Click
                    // text[curr_cursor] = 0;
                    // for (i = curr_cursor; i < sizeof(text); i++) text[i] = 0;
                    if (curr_cursor == 0)
                    {
                        ok = true;
                        memset(text, 0, sizeof(text));
                    }
                    if (curr_cursor > 0)
                        curr_cursor--;
                    encoder0Pos = text[curr_cursor];
                }
                else
                { // One Click
                    if (curr_cursor < (length - 1))
                        curr_cursor++;
                    else
                        curr_cursor = length - 1;
                    // text[curr_cursor] = 0;
                }
                for (i = curr_cursor; i < 50; i++)
                    text[i] = 0;
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                ok = true;
            }
        }
    } while (!ok);
    display.fillRect(x + 1, y + 1, w - 2, 9, BLACK);
    for (i = 0; i <= curr_cursor; i++)
    {
        display.drawChar((i * char_with) + x + 2, y + 2, text[i], BLACK, WHITE, 1);
        /*display.setCursor((i * char_with) + x + 2, y + 2);
        display.print(text[i]);*/
    }
    text[i] = 0;
    display.display();
    // msgBox(F("KEY Back"));
    while (digitalRead(keyPush) == LOW)
        ;
}

void MyTextBox::TextBoxShow()
{
    int w = (length * 7) + 4;
    int char_with = 7;
    int i;
    display.fillRect(x, y, w, 11, BLACK);
    display.drawRect(x, y, w, 11, WHITE);
    display.fillRect(x + 1, y + 1, w - 2, 9, BLACK);
    if (isSelect)
        display.drawRect(x + 1, y + 1, w - 2, 9, WHITE);
    for (i = 0; i <= (int)strlen(text); i++)
    {
        // for (i = 0; i <= curr_cursor; i++) {
        if (i >= length)
            break;
        display.drawChar((i * char_with) + x + 2, y + 2, text[i], WHITE, BLACK, 1);
        /*display.setCursor((i * char_with) + x + 2, y + 2);
        display.print(text[i]);*/
    }
    display.display();
}

void MyCheckBox::Toggle()
{
    if (Checked)
        Checked = false;
    else
        Checked = true;
}

void MyCheckBox::CheckBoxShow()
{
    int w = (strlen(text) * 6) + 10;
    // int margin_x = 1, char_with = 7;
    // int i;
    display.fillRect(x, y, w, 8, BLACK);
    display.drawRect(x, y, 8, 8, WHITE);
    display.fillRect(x + 1, y + 1, 6, 6, BLACK);
    if (Checked)
    {
        display.drawLine(x + 1, y + 1, x + 7, y + 7, WHITE);
        display.drawLine(x, y + 7, x + 7, y + 1, WHITE);
    }
    display.setCursor(x + 10, y);
    display.print(text);
    if (isSelect)
    {
        display.setCursor(x + 11, y + 1);
        display.print(text);
    }
    display.display();
}

void MyButtonBox::Toggle()
{
    if (Checked)
        Checked = false;
    else
        Checked = true;
}

void MyButtonBox::Show()
{
    int w = (strlen(text) * 6) + 4;
    // int w = (length * 7) + 4;
    // int char_with = 7;
    // unsigned int i;
    display.fillRect(x, y, w, 12, BLACK);
    if (isSelect)
    {
        // if (Border) {
        // display.fillRect(x, y, w, 11, WHITE);
        /*display.drawLine(x + 1, y + 12, x + w + 1, y + 12, WHITE);
        display.drawLine(x + w + 1, y + 1, x + w + 1, y + 12, WHITE);*/
        //}
        display.fillRect(x, y, w, 11, WHITE);
        display.setTextColor(BLACK);
        display.setCursor(x + 2, y + 2);
        display.print(text);
    }
    else
    {
        if (Border)
        {
            display.drawRect(x, y, w, 11, WHITE);
            display.drawLine(x + 1, y + 11, x + w, y + 11, WHITE);
            display.drawLine(x + w, y + 1, x + w, y + 11, WHITE);
        }
        display.setTextColor(WHITE);
        display.setCursor(x + 2, y + 2);
        display.print(text);
    }
    display.setTextColor(WHITE);
}

void MyComboBox::SelectValue(long val_min, long val_max, long step)
{
    int w = (length * 7) + 4;
    int keyPrev = encoder0Pos;
    bool ok = false;
    display.fillRect(x, y, w, 11, BLACK);
    display.drawRect(x, y, w, 11, WHITE);

    // current = atol(text);
    if (current > val_max)
        current = val_min;

    display.fillRect(x + 1, y + 1, w - 2, 9, WHITE);
    display.setTextColor(BLACK);

