nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.setCursor(0, 20);
    display.print("MINV");
    cbBox[0].isValue = true;
    cbBox[0].x = 25;
    cbBox[0].y = 18;
    cbBox[0].length = 3;
    cbBox[0].char_max = 999;
    cbBox[0].SetIndex(config.trk_maxinterval);

    display.setCursor(63, 20);
    display.print("LINV");
    cbBox[1].isValue = true;
    cbBox[1].x = 87;
    cbBox[1].y = 18;
    cbBox[1].length = 4;
    cbBox[1].char_max = 9999;
    cbBox[1].SetIndex(config.trk_slowinterval);

    display.setCursor(0, 32);
    display.print("HSPD");
    cbBox[2].isValue = true;
    cbBox[2].x = 25;
    cbBox[2].y = 30;
    cbBox[2].length = 3;
    cbBox[2].char_max = 300;
    cbBox[2].SetIndex(config.trk_hspeed);

    display.setCursor(0, 44);
    display.print("LSPD");
    cbBox[3].isValue = true;
    cbBox[3].x = 25;
    cbBox[3].y = 42;
    cbBox[3].length = 2;
    cbBox[3].char_max = 99;
    cbBox[3].SetIndex(config.trk_lspeed);

    display.setCursor(0, 56);
    display.print("ANG:");
    cbBox[4].isValue = true;
    cbBox[4].x = 25;
    cbBox[4].y = 54;
    cbBox[4].length = 2;
    cbBox[4].char_max = 180;
    cbBox[4].SetIndex(config.trk_minangle);

    display.setCursor(67, 35);
    display.print("MOV");
    symBox[0].x = 65;
    symBox[0].y = 43;
    symBox[0].table = config.trk_symmove[0];
    symBox[0].symbol = config.trk_symmove[1];
    symBox[0].SetIndex(config.trk_symmove[1]);
    symBox[0].Show();

    display.setCursor(99, 35);
    display.print("STP");
    symBox[1].x = 98;
    symBox[1].y = 43;
    symBox[1].table = config.trk_symstop[0];
    symBox[1].symbol = config.trk_symstop[1];
    symBox[1].SetIndex(config.trk_symstop[1]);
    symBox[1].Show();

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 5; i++)
            {
                cbBox[i].isSelect = false;
            }
            symBox[0].isSelect = false;
            symBox[1].isSelect = false;

            if (encoder0Pos < 5)
                cbBox[encoder0Pos].isSelect = true;
            if (encoder0Pos > 4)
                symBox[encoder0Pos - 5].isSelect = true;
            for (i = 0; i < 5; i++)
            {
                cbBox[i].Show();
            }
            symBox[0].Show();
            symBox[1].Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i < 5)
                {
                    switch (i)
                    {
                    case 0:
                        cbBox[i].SelectValue(5, 999, 1);
                        config.trk_maxinterval = cbBox[i].GetValue();
                        break;
                    case 1:
                        cbBox[i].SelectValue(60, 9999, 60);
                        config.trk_slowinterval = cbBox[i].GetValue();
                        break;
                    case 2:
                        cbBox[i].SelectValue(5, 300, 1);
                        config.trk_hspeed = cbBox[i].GetValue();
                        break;
                    case 3:
                        cbBox[i].SelectValue(1, 99, 1);
                        config.trk_lspeed = cbBox[i].GetValue();
                        break;
                    case 4:
                        cbBox[i].SelectValue(5, 90, 1);
                        config.trk_minangle = cbBox[i].GetValue();
                        break;
                    }
                    encoder0Pos = keyPrev;
                    cbBox[i].Show();
                }
                else if (encoder0Pos > 4)
                {
                    i -= 5;
                    symBox[i].SelectItem();
                    switch (i)
                    {
                    case 0:
                        config.trk_symmove[0] = symBox[i].table;
                        config.trk_symmove[1] = symBox[i].symbol;
                        break;
                    case 1:
                        config.trk_symstop[0] = symBox[i].table;
                        config.trk_symstop[1] = symBox[i].symbol;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    symBox[i].Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_wifi_AP_selected(MenuItem *p_menu_item)
{
    MyTextBox txtBox[2];
    MyCheckBox chkBoxWiFi;
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 4;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("WIFI AP CFG");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("SSID:");
    txtBox[0].x = 0;
    txtBox[0].y = 27;
    txtBox[0].length = 17;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.wifi_ap_ssid);

    if (config.wifi_mode & WIFI_AP_FIX)
    {
        chkBoxWiFi.Checked = true;
    }
    else
    {
        chkBoxWiFi.Checked = false;
    }

    chkBoxWiFi.x = 82;
    chkBoxWiFi.y = 18;
    sprintf(chkBoxWiFi.text, "Enable");

    display.setCursor(0, 44);
    display.print("PASS:");
    txtBox[1].x = 0;
    txtBox[1].y = 53;
    txtBox[1].length = 14;
    txtBox[1].type = 0;
    strcpy(txtBox[1].text, config.wifi_ap_pass);

    display.setCursor(55, 42);
    display.print("PWR:");
    display.setCursor(110, 42);
    display.print("dBm");
    cbBox.isValue = true;
    cbBox.x = 80;
    cbBox.y = 40;
    cbBox.length = 2;
    cbBox.maxItem(20);
    cbBox.char_max = 20;
    cbBox.SetIndex(config.wifi_power);

