nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 2; i++)
                txtBox[i].isSelect = false;
            chkBoxWiFi.isSelect = false;
            cbBox.isSelect = false;
            if (encoder0Pos < 2)
                txtBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 2)
                chkBoxWiFi.isSelect = true;
            if (encoder0Pos == 3)
                cbBox.isSelect = true;
            for (i = 0; i < 2; i++)
                txtBox[i].TextBoxShow();
            chkBoxWiFi.CheckBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    // msgBox("KEY Back");
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (encoder0Pos < 2)
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strcpy(config.wifi_ap_ssid, txtBox[0].text);
                        break;
                    case 1:
                        strcpy(config.wifi_ap_pass, txtBox[1].text);
                        break;
                    }
                    encoder0Pos = keyPrev + 1;
                }
                else if (encoder0Pos == 2)
                {
                    chkBoxWiFi.Toggle();
                    if (chkBoxWiFi.Checked)
                    {
                        config.wifi_mode |= WIFI_AP_FIX;
                    }
                    else
                    {
                        config.wifi_mode &= ~WIFI_AP_FIX;
                    }
                    encoder0Pos = keyPrev;
                    chkBoxWiFi.CheckBoxShow();
                }
                else if (encoder0Pos == 3)
                {
                    cbBox.SelectValue(0, 20, 1);
                    config.wifi_power = (unsigned char)cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    // if (config.wifi_enable)
    // {
    //     WiFi.disconnect(false);
    //     conStatNetwork = CON_WIFI;
    // }
    // else
    // {
    //     WiFi.disconnect(true);
    //     conStatNetwork = CON_WIFI;
    // }
}

void on_wifi_Client_selected(MenuItem *p_menu_item)
{
    MyTextBox txtBox[2];
    MyCheckBox chkBoxWiFi;
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 4;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("WIFI CLIENT CFG");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("SSID:");
    txtBox[0].x = 0;
    txtBox[0].y = 27;
    txtBox[0].length = 17;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.wifi_ssid);

    if (config.wifi_mode & WIFI_STA_FIX)
    {
        chkBoxWiFi.Checked = true;
    }
    else
    {
        chkBoxWiFi.Checked = false;
    }

    chkBoxWiFi.x = 82;
    chkBoxWiFi.y = 18;
    sprintf(chkBoxWiFi.text, "Enable");

    display.setCursor(0, 44);
    display.print("PASS:");
    txtBox[1].x = 0;
    txtBox[1].y = 53;
    txtBox[1].length = 14;
    txtBox[1].type = 0;
    strcpy(txtBox[1].text, config.wifi_pass);

    display.setCursor(55, 42);
    display.print("PWR:");
    display.setCursor(110, 42);
    display.print("dBm");
    cbBox.isValue = true;
    cbBox.x = 80;
    cbBox.y = 40;
    cbBox.length = 2;
    cbBox.maxItem(20);
    cbBox.char_max = 20;
    cbBox.SetIndex(config.wifi_power);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 2; i++)
                txtBox[i].isSelect = false;
            chkBoxWiFi.isSelect = false;
            cbBox.isSelect = false;
            if (encoder0Pos < 2)
                txtBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 2)
                chkBoxWiFi.isSelect = true;
            if (encoder0Pos == 3)
                cbBox.isSelect = true;
            for (i = 0; i < 2; i++)
                txtBox[i].TextBoxShow();
            chkBoxWiFi.CheckBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    // msgBox("KEY Back");
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (encoder0Pos < 2)
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strcpy(config.wifi_ssid, txtBox[0].text);
                        break;
                    case 1:
                        strcpy(config.wifi_pass, txtBox[1].text);
                        break;
                    }
                    encoder0Pos = keyPrev + 1;
                }
                else if (encoder0Pos == 2)
                {
                    chkBoxWiFi.Toggle();
                    if (chkBoxWiFi.Checked)
                    {
                        config.wifi_mode |= WIFI_STA_FIX;
                    }
                    else
                    {
                        config.wifi_mode &= ~WIFI_STA_FIX;
                    }
                    encoder0Pos = keyPrev;
                    chkBoxWiFi.CheckBoxShow();
                }
                else if (encoder0Pos == 3)
                {
                    cbBox.SelectValue(0, 20, 1);
                    config.wifi_power = (unsigned char)cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    // if (config.wifi_enable)
    // {
    //     WiFi.disconnect(false);
    //     conStatNetwork = CON_WIFI;
    // }
    // else
    // {
    //     WiFi.disconnect(true);
    //     conStatNetwork = CON_WIFI;
    // }
}

void on_bluetooth_selected(MenuItem *p_menu_item)
{
    MyTextBox txtBox[2];
    MyCheckBox chkBoxWiFi;
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 4;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=BLUETOOTH=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("NAME:");
    txtBox[0].x = 0;
    txtBox[0].y = 27;
    txtBox[0].length = 17;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.bt_name);

    chkBoxWiFi.Checked = config.bt_master;

    chkBoxWiFi.x = 82;
    chkBoxWiFi.y = 18;
    sprintf(chkBoxWiFi.text, "Enable");

