nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    chkGPS.Checked = config.trk_gps;
    chkGPS.isSelect = false;
    chkGPS.x = 0;
    chkGPS.y = 54;
    sprintf(chkGPS.text, "GPS");

    chkSMBeacon.Checked = config.trk_smartbeacon;
    chkSMBeacon.isSelect = false;
    chkSMBeacon.x = 35;
    chkSMBeacon.y = 54;
    sprintf(chkSMBeacon.text, "SmartBCN");

    display.fillRect(98, 31, 30, 11, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(100, 33);
    display.print("ICON");
    display.setTextColor(WHITE);
    symBox.x = 98;
    symBox.y = 43;
    symBox.table = config.trk_symbol[0];
    symBox.symbol = config.trk_symbol[1];
    symBox.SetIndex(config.trk_symbol[1]);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < max_sel; i++)
            {
                if (i < 3)
                    txtBox[i].isSelect = false;
                if (i == 3)
                    cbBox.isSelect = false;
                if (i == 6)
                    symBox.isSelect = false;
                if (i == 5)
                    chkSMBeacon.isSelect = false;
                if (i == 4)
                    chkGPS.isSelect = false;
            }
            if (encoder0Pos < 3)
                txtBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 6)
                symBox.isSelect = true;
            if (encoder0Pos == 5)
                chkSMBeacon.isSelect = true;
            if (encoder0Pos == 4)
                chkGPS.isSelect = true;
            if (encoder0Pos == 3)
                cbBox.isSelect = true;
            for (i = 0; i < 3; i++)
                txtBox[i].TextBoxShow();
            symBox.Show();
            chkGPS.CheckBoxShow();
            chkSMBeacon.CheckBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 6)
                {
                    symBox.SelectItem();
                    config.trk_symbol[0] = symBox.table;
                    config.trk_symbol[1] = symBox.symbol;
                    encoder0Pos = keyPrev;
                }
                else if (i == 4)
                {
                    chkGPS.Toggle();
                    config.trk_gps = chkGPS.Checked;
                    if (config.trk_gps == false)
                    {
                        chkSMBeacon.Checked = false;
                        chkSMBeacon.CheckBoxShow();
                    }
                    encoder0Pos = keyPrev;
                    chkGPS.CheckBoxShow();
                }
                else if (i == 5)
                {
                    chkSMBeacon.Toggle();
                    config.trk_smartbeacon = chkSMBeacon.Checked;
                    encoder0Pos = keyPrev;
                    chkSMBeacon.CheckBoxShow();
                }
                else if (i == 3)
                {
                    cbBox.SelectValue(0, 15, 1);
                    config.trk_ssid = cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                else
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strncpy(config.trk_mycall, txtBox[i].text, 7);
                        config.trk_mycall[7] = 0;
                        break;
                    case 1:
                        config.trk_lat = atof(txtBox[i].text); // strcpy(config.mylat, txtBox[i].text);
                        break;
                    case 2:
                        config.trk_lon = atof(txtBox[i].text); // strcpy(config.mylon, txtBox[i].text);
                        break;
                    }
                    encoder0Pos = keyPrev + 1;
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_tracker_function_selected(MenuItem *p_menu_item)
{
    int max_sel = 8;
    // MyTextBox txtBox[2];
    MyCheckBox chkBox[6];
    MyComboBox cbBox[2];
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=TRACKER FUNCION=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBox[0].Checked = config.trk_en;
    chkBox[0].x = 0;
    chkBox[0].y = 18;
    sprintf(chkBox[0].text, "BCN");

    chkBox[1].Checked = config.trk_loc2rf;
    chkBox[1].x = 0;
    chkBox[1].y = 30;
    sprintf(chkBox[1].text, "POS2RF");

    chkBox[2].Checked = config.trk_loc2inet;
    chkBox[2].x = 60;
    chkBox[2].y = 30;
    sprintf(chkBox[2].text, "POS2INET");

    chkBox[3].Checked = config.trk_compress;
    chkBox[3].x = 0;
    chkBox[3].y = 40;
    sprintf(chkBox[3].text, "COMP");

    chkBox[4].Checked = config.trk_altitude;
    chkBox[4].x = 40;
    chkBox[4].y = 40;
    sprintf(chkBox[4].text, "ALT");

    chkBox[5].Checked = config.trk_cst;
    chkBox[5].x = 75;
    chkBox[5].y = 40;
    sprintf(chkBox[5].text, "CSR/SPD");

    display.setCursor(35, 20);
    display.print("INTERVAL");
    cbBox[0].isValue = true;
    cbBox[0].x = 85;
    cbBox[0].y = 18;
    cbBox[0].length = 4;
    cbBox[0].char_max = 1800;
    cbBox[0].SetIndex(config.trk_interval);

    display.setCursor(0, 52);
    display.print("PTH:");
    cbBox[1].isValue = false;
    cbBox[1].x = 20;
    cbBox[1].y = 50;
    cbBox[1].length = 13;
    cbBox[1].maxItem(4);
    int sel = 0;
    for (i = 0; i < 4; i++)
    {
        cbBox[1].AddItem(i, config.path[i]);
        if (!strcmp(&config.trk_path[0], &config.path[i][0]))
            sel = i;
    }
    cbBox[1].SetIndex(sel);

