nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 6; i++)
                chkBox[i].isSelect = false;
            cbBox[0].isSelect = false;
            cbBox[1].isSelect = false;

            if (encoder0Pos < 6)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 6)
                cbBox[0].isSelect = true;
            if (encoder0Pos == 7)
                cbBox[1].isSelect = true;

            for (i = 0; i < 6; i++)
                chkBox[i].CheckBoxShow();
            cbBox[0].Show();
            cbBox[1].Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 7) // Select PATH
                {
                    cbBox[1].SelectItem();
                    int n = cbBox[1].GetIndex();
                    if (n < 4)
                    {
                        strcpy(config.trk_path, config.path[n]);
                    }
                    encoder0Pos = keyPrev;
                    cbBox[1].Show();
                }
                else if (i == 6)
                {
                    cbBox[0].SelectValue(0, 1800, 60);
                    config.trk_interval = cbBox[0].GetValue();
                    encoder0Pos = keyPrev;
                    cbBox[0].Show();
                }
                else
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.trk_en = chkBox[i].Checked;
                        break;
                    case 1:
                        config.trk_loc2rf = chkBox[i].Checked;
                        break;
                    case 2:
                        config.trk_loc2inet = chkBox[i].Checked;
                        break;
                    case 3:
                        config.trk_compress = chkBox[i].Checked;
                        break;
                    case 4:
                        config.trk_altitude = chkBox[i].Checked;
                        break;
                    case 5:
                        config.trk_cst = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_tracker_option_selected(MenuItem *p_menu_item)
{
    int max_sel = 6;
    MyTextBox txtBox[3];
    MyCheckBox chkBox[3];
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=TRACKER OPTION=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBox[0].Checked = config.trk_bat;
    chkBox[0].x = 0;
    chkBox[0].y = 18;
    sprintf(chkBox[0].text, "BAT");

    chkBox[1].Checked = config.trk_sat;
    chkBox[1].x = 40;
    chkBox[1].y = 18;
    sprintf(chkBox[1].text, "SAT");

    chkBox[2].Checked = config.trk_dx;
    chkBox[2].x = 75;
    chkBox[2].y = 18;
    sprintf(chkBox[2].text, "DX");

    // display.setCursor(0, 30);
    // display.print("OBJ:");
    txtBox[0].x = 30;
    txtBox[0].y = 28;
    txtBox[0].length = 11;
    txtBox[0].type = 0;
    // strcpy(txtBox[0].text, config.trk_object);

    display.setCursor(0, 42);
    display.print("ITEM");
    txtBox[1].x = 30;
    txtBox[1].y = 40;
    txtBox[1].length = 11;
    txtBox[1].type = 0;
    strcpy(txtBox[1].text, config.trk_item);

    display.setCursor(0, 54);
    display.print("TXT");
    txtBox[2].x = 20;
    txtBox[2].y = 52;
    txtBox[2].length = 14;
    txtBox[2].type = 0;
    strcpy(txtBox[2].text, config.trk_comment);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 3; i++)
                chkBox[i].isSelect = false;
            for (i = 0; i < 3; i++)
                txtBox[i].isSelect = false;

            if (encoder0Pos < 3)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos > 2)
                txtBox[encoder0Pos - 3].isSelect = true;
            for (i = 0; i < 3; i++)
                chkBox[i].CheckBoxShow();
            for (i = 0; i < 3; i++)
                txtBox[i].TextBoxShow();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i > 2)
                {
                    switch (i)
                    {
                    case 3:
                        txtBox[0].TextBox();
                        // strcpy(config.trk_object, txtBox[0].text);
                        break;
                    case 4:
                        txtBox[1].TextBox();
                        strcpy(config.trk_item, txtBox[1].text);
                        break;
                    case 5:
                        txtBox[2].TextBox();
                        strcpy(config.trk_comment, txtBox[2].text);
                        break;
                    }
                    encoder0Pos = keyPrev;
                }
                else
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.trk_bat = chkBox[i].Checked;
                        break;
                    case 1:
                        config.trk_sat = chkBox[i].Checked;
                        break;
                    case 2:
                        config.trk_dx = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_digi_position_selected(MenuItem *p_menu_item)
{
    int max_sel = 6;
    MyTextBox txtBox[3];
    MySymbolBox symBox;
    MyCheckBox chkGPS;
    MyComboBox cbBox;
    String str;
    char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("DIGI POSITION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("MyCall:");
    txtBox[0].x = 41;
    txtBox[0].y = 16;
    txtBox[0].length = 7;
    txtBox[0].type = 0;
    str = String(config.digi_mycall);
    str.toUpperCase();
    str.toCharArray(&ch[0], 10);
    strcpy(txtBox[0].text, ch);

    display.setCursor(95, 18);
    display.print("-");
    cbBox.isValue = true;
    cbBox.x = 101;
    cbBox.y = 16;
    cbBox.length = 2;
    cbBox.maxItem(15);
    cbBox.char_max = 15;
    cbBox.SetIndex(config.digi_ssid);

    display.setCursor(0, 30);
    display.print("LAT:");
    txtBox[1].x = 26;
    txtBox[1].y = 28;
    txtBox[1].length = 8;
    txtBox[1].type = 1;
    sprintf(txtBox[1].text, "%.5f", config.digi_lat);

    display.setCursor(0, 42);
    display.print("LON:");
    txtBox[2].x = 26;
    txtBox[2].y = 40;
    txtBox[2].length = 9;
    txtBox[2].type = 1;
    sprintf(txtBox[2].text, "%.5f", config.digi_lon);

