nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
            if (encoder0Pos < 4)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 4)
                cbBox[0].isSelect = true;
            if (encoder0Pos == 5)
                cbBox[1].isSelect = true;

            for (i = 0; i < 4; i++)
                chkBox[i].CheckBoxShow();
            cbBox[0].Show();
            cbBox[1].Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 5) // Select PATH
                {
                    cbBox[1].SelectItem();
                    int n = cbBox[1].GetIndex();
                    if (n < 4)
                    {
                        strcpy(config.digi_path, config.path[n]);
                    }
                    encoder0Pos = keyPrev;
                    cbBox[1].Show();
                }
                else if (i == 4)
                {
                    cbBox[0].SelectValue(0, 1800, 60);
                    config.digi_interval = cbBox[0].GetValue();
                    encoder0Pos = keyPrev;
                    cbBox[0].Show();
                }
                else
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.digi_en = chkBox[i].Checked;
                        break;
                    case 1:
                        config.digi_bcn = chkBox[i].Checked;
                        break;
                    case 2:
                        config.digi_loc2rf = chkBox[i].Checked;
                        break;
                    case 3:
                        config.digi_loc2inet = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_digi_option_selected(MenuItem *p_menu_item)
{
    int max_sel = 4;
    MyTextBox txtBox;
    MyCheckBox chkBox;
    MyComboBox cbBox[2];
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=DIGI OPTION=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBox.Checked = false;
    chkBox.x = 0;
    chkBox.y = 18;
    sprintf(chkBox.text, "TLM");

    display.setCursor(35, 20);
    display.print("INTERVAL");
    cbBox[0].isValue = true;
    cbBox[0].x = 85;
    cbBox[0].y = 18;
    cbBox[0].length = 4;
    cbBox[0].char_max = 1800;
    cbBox[0].SetIndex(0);

    display.setCursor(0, 32);
    display.print("RPT_DELAY");
    cbBox[1].isValue = true;
    cbBox[1].x = 57;
    cbBox[1].y = 30;
    cbBox[1].length = 5;
    cbBox[1].char_max = 9999;
    cbBox[1].SetIndex(config.digi_delay);
    display.setCursor(110, 32);
    display.print("mS");

    display.setCursor(0, 44);
    display.print("TXT:");
    txtBox.x = 20;
    txtBox.y = 42;
    txtBox.length = 14;
    txtBox.type = ALL;
    strcpy(txtBox.text, config.digi_comment);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;

            for (i = 0; i < 2; i++)
                cbBox[i].isSelect = false;
            chkBox.isSelect = false;
            txtBox.isSelect = false;

            if (encoder0Pos == 0)
                chkBox.isSelect = true;
            if (encoder0Pos > 0 && encoder0Pos < 3)
                cbBox[encoder0Pos - 1].isSelect = true;
            if (encoder0Pos == 3)
                txtBox.isSelect = true;
            for (i = 0; i < 2; i++)
                cbBox[i].Show();
            chkBox.CheckBoxShow();
            txtBox.TextBoxShow();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                ;
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 3)
                {
                    txtBox.TextBox();
                    strcpy(config.digi_comment, txtBox.text);
                    encoder0Pos = keyPrev;
                }
                else if (i == 0)
                {
                    chkBox.Toggle();
                    // config.digi_tlm = chkBox.Checked;
                    encoder0Pos = keyPrev;
                    chkBox.CheckBoxShow();
                }
                else
                {
                    i -= 1;
                    switch (i)
                    {
                    case 0:
                        cbBox[i].SelectValue(0, 1800, 60);
                        // config.digi_tlm_interval = cbBox[i].GetValue();
                        break;
                    case 1:
                        cbBox[i].SelectValue(0, 9999, 10);
                        config.digi_delay = cbBox[i].GetValue();
                        break;
                    }
                    encoder0Pos = keyPrev;
                    cbBox[i].Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

// void on_tncfunction_selected(MenuItem *p_menu_item)
// {
//     int max_sel = 9;
//     // MyTextBox txtBox[2];
//     MyCheckBox chkBox[9];
//     String str;
//     // char ch[10];
//     int x, i;
//     int keyPrev = -1;
//     display.clearDisplay();
//     display.fillRect(0, 0, 128, 16, WHITE);
//     display.setTextColor(BLACK);
//     str = String("nTNC SETTING");
//     x = str.length() * 6;
//     display.setCursor(64 - (x / 2), 4);
//     display.print(str);
//     display.setTextColor(WHITE);

//     chkBox[0].Checked = config.tnc;
//     chkBox[0].x = 0;
//     chkBox[0].y = 18;
//     sprintf(chkBox[0].text, "TNC");

//     chkBox[1].Checked = config.tnc_digi;
//     chkBox[1].x = 35;
//     chkBox[1].y = 18;
//     sprintf(chkBox[1].text, "DIGI");

//     chkBox[2].Checked = config.tnc_tracker;
//     chkBox[2].x = 75;
//     chkBox[2].y = 18;
//     sprintf(chkBox[2].text, "TRACKER");

