nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
//     chkEn.Checked = config.tnc;
//     chkEn.x = 98;
//     chkEn.y = 29;
//     sprintf(chkEn.text, "TNC");

//     display.setCursor(0, 30);
//     display.print("ITEM:");
//     txtBox[2].x = 30;
//     txtBox[2].y = 28;
//     txtBox[2].length = 9;
//     strcpy(txtBox[2].text, config.tnc_item);

//     display.setCursor(0, 42);
//     display.print("PTH:");
//     txtBox[3].x = 25;
//     txtBox[3].y = 40;
//     txtBox[3].length = 14;
//     strcpy(txtBox[3].text, config.tnc_path);

//     display.setCursor(0, 54);
//     display.print("CMN:");
//     txtBox[4].x = 25;
//     txtBox[4].y = 52;
//     txtBox[4].length = 14;
//     strcpy(txtBox[4].text, config.tnc_comment);

//     display.display();
//     encoder0Pos = 0;
//     delay(100);
//     do
//     {
//         if (encoder0Pos >= max_sel)
//             encoder0Pos = 0;
//         if (encoder0Pos < 0)
//             encoder0Pos = max_sel - 1;
//         if (keyPrev != encoder0Pos)
//         {
//             keyPrev = encoder0Pos;
//             for (i = 0; i < max_sel; i++)
//             {
//                 if (i == 1)
//                     cbBox.isSelect = false;
//                 else if (i == 5)
//                     chkEn.isSelect = false;
//                 else
//                     txtBox[i].isSelect = false;
//             }
//             if (encoder0Pos == 1)
//                 cbBox.isSelect = true;
//             else if (encoder0Pos == 5)
//                 chkEn.isSelect = true;
//             else
//                 txtBox[encoder0Pos].isSelect = true;
//             for (i = 0; i < max_sel; i++)
//             {
//                 if (i == 1)
//                     cbBox.Show();
//                 else if (i == 5)
//                     chkEn.CheckBoxShow();
//                 else
//                     txtBox[i].TextBoxShow();
//             }
//         }
//         else
//         {
//             delay(50);
//         }
//         if (digitalRead(keyPush) == LOW)
//         {
//             currentTime = millis();
//             while (digitalRead(keyPush) == LOW)
//             {
//                 if ((millis() - currentTime) > 2000)
//                     break; // OK Timeout
//             };
//             if ((millis() - currentTime) < 1500)
//             {
//                 i = encoder0Pos;
//                 if (i == 1)
//                 {
//                     cbBox.SelectValue(0, 15, 1);
//                     config.aprs_ssid = cbBox.GetValue();
//                     encoder0Pos = keyPrev;
//                 }
//                 else if (i == 5)
//                 {
//                     chkEn.Toggle();
//                     config.tnc = chkEn.Checked;
//                     encoder0Pos = keyPrev;
//                     chkEn.CheckBoxShow();
//                 }
//                 else
//                 {
//                     txtBox[i].TextBox();
//                     switch (i)
//                     {
//                     case 0:
//                         strncpy(config.aprs_mycall, txtBox[i].text, 7);
//                         config.aprs_mycall[7] = 0;
//                         break;
//                     // case 1: config.aprs_ssid = atol(txtBox[i].text);
//                     //	break;
//                     case 2:
//                         strcpy(config.tnc_item, txtBox[i].text);
//                         break;
//                     case 3:
//                         strcpy(config.tnc_path, txtBox[i].text);
//                         break;
//                     case 4:
//                         strcpy(config.tnc_comment, txtBox[i].text);
//                         break;
//                     }
//                     encoder0Pos = keyPrev + 1;
//                 }
//                 while (digitalRead(keyPush) == LOW)
//                     ;
//             }
//             else
//             {
//                 break;
//             }
//         }
//     } while (1);
//     // display.clearDisplay();
//     // display.setCursor(30, 4);
//     // display.print("SAVE & EXIT");
//     // display.display();
//     msgBox("KEY EXIT");
//     while (digitalRead(keyPush) == LOW)
//         ;
// }

void on_rfconfig_selected(MenuItem *p_menu_item)
{
    MyTextBox txtBox[2];
    MyCheckBox chkBoxRF;
    MyComboBox cbBox[2];
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 5;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("=RF MODULE=");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBoxRF.Checked = config.rf_en;
    chkBoxRF.x = 0;
    chkBoxRF.y = 18;
    sprintf(chkBoxRF.text, "RF_ENABLE");

    display.setCursor(0, 30);
    display.print("FREQ_TX:");
    display.setCursor(110, 30);
    display.print("MHz");
    txtBox[0].x = 47;
    txtBox[0].y = 28;
    txtBox[0].length = 8;
    txtBox[0].type = 1;
    sprintf(txtBox[0].text, "%.4f", config.freq_tx);
    display.setCursor(0, 40);
    display.print("FREQ_RX:");
    display.setCursor(110, 40);
    display.print("MHz");
    txtBox[1].x = 47;
    txtBox[1].y = 38;
    txtBox[1].length = 8;
    txtBox[1].type = 1;
    sprintf(txtBox[1].text, "%.4f", config.freq_rx);

    display.setCursor(0, 54);
    display.print("SEQ:");
    cbBox[0].isValue = true;
    cbBox[0].x = 25;
    cbBox[0].y = 52;
    cbBox[0].length = 1;
    cbBox[0].maxItem(8);
    cbBox[0].char_max = 8;
    cbBox[0].SetIndex(config.sql_level);

    display.setCursor(60, 54);
    display.print("PWR:");
    cbBox[1].isValue = false;
    cbBox[1].x = 80;
    cbBox[1].y = 52;
    cbBox[1].length = 3;
    cbBox[1].AddItem(0, "LOW");
    cbBox[1].AddItem(1, "HI");
    cbBox[1].maxItem(2);
    cbBox[1].SetIndex(config.rf_power);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 2; i++)
                cbBox[i].isSelect = false;
            chkBoxRF.isSelect = false;
            txtBox[0].isSelect = false;
            txtBox[1].isSelect = false;
            if (encoder0Pos < 2)
                cbBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 2)
                chkBoxRF.isSelect = true;
            if (encoder0Pos == 3)
                txtBox[0].isSelect = true;
            if (encoder0Pos == 4)
                txtBox[1].isSelect = true;
            for (i = 0; i < 2; i++)
                cbBox[i].Show();
            chkBoxRF.CheckBoxShow();
            txtBox[0].TextBoxShow();
            txtBox[1].TextBoxShow();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                delay(10);
                if ((millis() - currentTime) > 2000)
                {
                    // msgBox("KEY Back");
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (encoder0Pos == 0)
                {
                    cbBox[0].SelectValue(0, 8, 1);
                    config.sql_level = cbBox[0].GetValue();
                    encoder0Pos = keyPrev + 1;
                    cbBox[1].Show();
                }
                else if (encoder0Pos == 1)
                {
                    // cbBox[1].SelectValue(0, 1, 1);
                    cbBox[1].SelectItem();
                    config.rf_power = cbBox[1].GetIndex();
                    encoder0Pos = keyPrev + 1;
                    cbBox[1].Show();
                }
                else if (encoder0Pos == 2) // Focus Check Box Enable
                {
                    chkBoxRF.Toggle();
                    config.rf_en = chkBoxRF.Checked;
                    encoder0Pos = keyPrev;
                    chkBoxRF.CheckBoxShow();
                }
                else if (encoder0Pos == 3)
                {
                    txtBox[0].TextBox();
                    // strcpy(config.freq_tx, txtBox.text);
                    config.freq_tx = atof(txtBox[0].text);
                    encoder0Pos = keyPrev;
                    txtBox[0].TextBoxShow();
                }
                else if (encoder0Pos == 4)
                {
                    txtBox[1].TextBox();
                    // strcpy(config.freq_tx, txtBox.text);
                    config.freq_rx = atof(txtBox[1].text);
                    encoder0Pos = keyPrev;
                    txtBox[1].TextBoxShow();
                }
                while (digitalRead(keyPush) == LOW)
                    delay(10);
            }
            else
            {
                break;
            }
        }
        delay(10);
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        delay(10);
}

void on_display_selected(MenuItem *p_menu_item)
{
    // MyTextBox txtBox;
    MyCheckBox chkBoxWiFi;
    MyComboBox cbDim, cbContrast, cbStartup;
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 4;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("Display Config");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBoxWiFi.Checked = config.title;
    chkBoxWiFi.x = 0;
    chkBoxWiFi.y = 18;
    sprintf(chkBoxWiFi.text, "TITLE");

    display.setCursor(0, 30);
    display.print("DIM:");
    cbDim.isValue = false;
    cbDim.x = 25;
    cbDim.y = 28;
    cbDim.length = 9;
    cbDim.maxItem(5);
    cbDim.AddItem(0, "HI");
    cbDim.AddItem(1, "LOW");
    cbDim.AddItem(2, "AUTO DIM");
    cbDim.AddItem(3, "DAY/NIGHT");
    cbDim.AddItem(4, "CONTRAST");

    // cbBox.char_max = 999;
    cbDim.SetIndex(config.dim);

    display.setCursor(0, 42);
    display.print("CONTRAST:");
    cbContrast.isValue = true;
    cbContrast.x = 55;
    cbContrast.y = 40;
    cbContrast.length = 3;
    cbContrast.maxItem(255);
    cbContrast.char_max = 255;
    cbContrast.SetIndex(config.contrast);

    display.setCursor(0, 54);
    display.print("FDP:");
    cbStartup.isValue = false;
    cbStartup.x = 25;
    cbStartup.y = 52;
    cbStartup.length = 10;
    cbStartup.maxItem(6);
    cbStartup.AddItem(0, "STATUS");
    cbStartup.AddItem(1, "LAST STA");
    cbStartup.AddItem(2, "TOP PKG");
    cbStartup.AddItem(3, "SYS INFO");
    cbStartup.AddItem(4, "GPS INFO");
    cbStartup.AddItem(5, "CST/SPD");
    if (config.startup > 5)
        config.startup = 5;
    cbStartup.SetIndex(config.startup);

