nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            cbDim.isSelect = false;
            cbContrast.isSelect = false;
            cbStartup.isSelect = false;
            chkBoxWiFi.isSelect = false;
            if (encoder0Pos == 1)
                cbDim.isSelect = true;
            if (encoder0Pos == 2)
                cbContrast.isSelect = true;
            if (encoder0Pos == 3)
                cbStartup.isSelect = true;
            if (encoder0Pos == 0)
                chkBoxWiFi.isSelect = true;
            cbDim.Show();
            cbContrast.Show();
            chkBoxWiFi.CheckBoxShow();
            cbStartup.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                delay(10);
                if ((millis() - currentTime) > 2000)
                {
                    // msgBox("KEY Back");
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (encoder0Pos == 0)
                {
                    chkBoxWiFi.Toggle();
                    config.title = chkBoxWiFi.Checked;
                    encoder0Pos = keyPrev;
                    chkBoxWiFi.CheckBoxShow();
                }
                else if (encoder0Pos == 1)
                {
                    cbDim.SelectItem();
                    config.dim = cbDim.GetIndex();
                    if (config.dim == 1)
                    {
                        display.dim(true);
                    }
                    else if (config.dim == 4)
                    {
                        // display.dim(true);
                        display.ssd1306_command(SSD1306_SETCONTRAST);
                        display.ssd1306_command(config.contrast);
                    }
                    else
                    {
                        display.dim(false);
                    }
                    cbDim.Show();
                }
                else if (encoder0Pos == 2)
                {
                    cbContrast.SelectValue(0, 200, 1);
                    config.contrast = cbContrast.GetValue();
                    // display.ssd1306_command(SSD1306_SETPRECHARGE);                  // 0xd9
                    // display.ssd1306_command(config.contrast);
                    // display.ssd1306_command(SSD1306_SETVCOMDETECT);                 // 0xDB
                    // display.ssd1306_command(config.contrast);
                    display.ssd1306_command(SSD1306_SETCONTRAST);
                    display.ssd1306_command(config.contrast);
                    cbContrast.Show();
                }
                else if (encoder0Pos == 3)
                {
                    cbStartup.SelectItem();
                    config.startup = cbStartup.GetIndex();
                    cbStartup.Show();
                }
                encoder0Pos = keyPrev;
                while (digitalRead(keyPush) == LOW)
                    delay(10);
            }
            else
            {
                break;
            }
        }
        delay(10);
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        delay(10);
}

void on_update_selected(MenuItem *p_menu_item)
{
    String str;
    char cstr[300];
    int x;

    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("OTA UPDATE");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("Current V");
    display.printf("%s%c\n", VERSION, VERSION_BUILD);

    display.println("Wait Download/Update");
    display.display();
    // delay(1000);
    delay(10);

    if (WiFi.status() != WL_CONNECTED)
    {
        WiFi.disconnect(false);
        delay(500);
        WiFi.mode(WIFI_STA);
        // WiFi.setTxPower(20);
        WiFi.begin(config.wifi_ssid, config.wifi_pass);
        while (WiFi.status() != WL_CONNECTED)
        {
            delay(100);
        }
    }

    // wait for WiFi connection
    if ((WiFi.status() == WL_CONNECTED))
    {
        t_httpUpdate_return ret = ESPhttpUpdate.update(String("http://www.dprns.com/ESP32/DRHotspot.bin"), String(VERSION));

        switch (ret)
        {
        case HTTP_UPDATE_FAILED:
            sprintf(cstr, "UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
            break;

        case HTTP_UPDATE_NO_UPDATES:
            sprintf(cstr, "UPDATE_NO_UPDATES");
            break;

        case HTTP_UPDATE_OK:
            sprintf(cstr, "UPDATE_OK");
            break;
        }

        SerialLOG.println(cstr);
        display.println(cstr);
        display.print("New Current V");
        display.printf("%s%c\n", VERSION, VERSION_BUILD);
        display.display();
        delay(2000);
    }
    else
    {
        SerialLOG.println("UPDATE FAIL!");
        SerialLOG.println("WiFi Disconnect");
        display.println("UPDATE FAIL!");
        display.println("WiFi Disconnect");
        display.display();
        // delay(1000);
    }
    while (digitalRead(keyPush) == HIGH)
        delay(10);
    WiFi.disconnect(true);
    // display.print("Update Successfully");
    // display.println("To AUTO RESTART");
    // display.display();
    // delay(2000);
    ESP.restart();
}

void on_infomation_selected(MenuItem *p_menu_item)
{
    String str;
    char cstr[50];
    int x;

    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("INFOMATION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("Firmware V");
    display.printf("%s%c\n", VERSION, VERSION_BUILD);
    display.println("Developer: HS5TQA");
    display.display();
    while (digitalRead(keyPush) == HIGH)
        delay(10);
}

void on_save_selected(MenuItem *p_menu_item)
{
    saveEEPROM();

    display.clearDisplay();
    display.setCursor(52, 4);
    display.print("SAVE");
    display.setCursor(0, 18);
    display.print("Save All Configure\n to EEPROM");
    display.display();
    delay(1000);
    while (digitalRead(keyPush) == LOW)
        delay(10);
}

