nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
void on_load_selected(MenuItem *p_menu_item)
{
    uint8_t *ptr;
    int i;
    int addr = 1;

    ptr = (byte *)&config;
    EEPROM.readBytes(1, ptr, sizeof(Configuration));
    uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));

    display.clearDisplay();
    display.setCursor(52, 4);
    display.print("LOAD");
    display.setCursor(0, 18);
    if (EEPROM.read(0) != chkSum)
    {
        display.print("Load Configuration OK!");
        log_d("Config EEPROM Error!");
        // defaultConfig();
    }
    else
    {
        display.print("Load Configuration Fail!");
    }
    display.display();
    delay(1000);
    while (digitalRead(keyPush) == LOW)
        delay(10);
}

void on_factory_selected(MenuItem *p_menu_item)
{
    defaultConfig();
    display.clearDisplay();
    display.setCursor(52, 4);
    display.print("FACTORY");
    display.setCursor(0, 18);
    display.print("Reset configuration to Factory");
    display.display();
    delay(1000);
    while (digitalRead(keyPush) == LOW)
        delay(10);
}

void on_reboot_selected(MenuItem *p_menu_item)
{
    display.clearDisplay();
    display.setCursor(52, 4);
    display.print("REBOOT");
    display.setCursor(0, 18);
    display.print("SYSTEM REBOOT");
    display.display();
    delay(1000);
    while (digitalRead(keyPush) == LOW)
        delay(10);
    WiFi.disconnect(true);
    ESP.restart();
}

void on_dashboard_selected(MenuItem *p_menu_item)
{
    if (WiFi.status() == WL_CONNECTED)
    {
        conStatNetwork = CON_SERVER;
        topBar(WiFi.RSSI());
    }
    else
    {
        conStatNetwork = CON_WIFI;
    }
    conStat = CON_NORMAL;
    display.clearDisplay();
    display.display();
}

void on_wifistatus_selected(MenuItem *p_menu_item)
{
    String str;
    // char ch[10];
    int x;
    // int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("WIFI STATUS");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    // display.setTextSize(1);
    display.setCursor(0, 16);
    display.print("SSID: ");
    display.print(WiFi.SSID());
    display.setCursor(0, 24);
    display.print("RSSI: ");
    display.print(WiFi.RSSI());
    display.println(" dBm");
    // display.setCursor(20, 32);
    display.print("MAC ");
    display.println(WiFi.macAddress());
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("GW: ");
    display.print(WiFi.gatewayIP());
    display.display();
    while (digitalRead(keyPush) == HIGH)
        delay(10);
}
// void on_back_selected(MenuItem *p_menu_item);

void on_tncmonitor_selected(MenuItem *p_menu_item)
{
    String str;
    // char cstr[50];
    int x;

    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("nTNC Monitor");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);
    display.display();

    while (digitalRead(keyPush) == HIGH)
    {
        delay(10);
        // if (Serial.available() > 0)
        // {
        //     String tnc2 = Serial.readStringUntil('\n');
        //     display.fillRect(0, 16, 128, 48, BLACK);
        //     display.setCursor(1, 18);
        //     display.print(tnc2);
        //     display.display();
        //     delay(2000);
        //     display.fillRect(0, 16, 128, 48, BLACK);
        //     display.display();
        // }
    }
}

void on_txbeacon_selected(MenuItem *p_menu_item)
{
    String str;
    int x;
    String rawTNC = myBeacon(String(",WIDE1-1"));
    // sprintf(cstr, "=%s%c%s%c%s%s\r\n", config.mylat, config.mysymbol[0], config.mylon, config.mysymbol[1], config.myphg, config.mycomment);
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("nTNC TX Beacon");
    x = str.length() * 6;
    // tncTxEnable = false;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);
    display.fillRect(0, 16, 128, 48, BLACK);
    display.setCursor(1, 25);
    display.print(rawTNC);
    display.display();
    // SerialTNC.print("\r\n");
    // SerialTNC.println("}" + rawTNC);
    delay(2000);
    // tncTxEnable = true;
}

void on_txstatus_selected(MenuItem *p_menu_item)
{
    String str;
    char cstr[300];
    int x;
    sprintf(cstr, ">WiFi IGate V%s%c\r\n", VERSION, VERSION_BUILD);
    // SerialTNC.flush();
    // tncTxEnable = false;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("nTNC TX RAW");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);
    display.fillRect(0, 16, 128, 48, BLACK);
    display.setCursor(1, 25);
    display.print(cstr);
    display.display();
}

byte htod(char *val, int str, int stp)
{
    char cstr[3];
    byte ret;
    cstr[0] = val[str];
    cstr[1] = val[stp];
    cstr[2] = 0;
    ret = (byte)strtol(cstr, 0, 16);
    return ret;
}

// Menu variables
MenuSystem ms(my_renderer);

Menu mnuAbout("ABOUT");
MenuItem mnuAbout_mi1("OTA Update", &on_update_selected);
MenuItem mnuAbout_mi2("WiFi Status", &on_wifistatus_selected);
MenuItem mnuAbout_mi3("Infomations", &on_infomation_selected);
MenuItem mnuAbout_mi4("Dash Board", &on_dashboard_selected);

Menu mnuConfig("Save/Load");
MenuItem mnuConfig_mi1("Save Config", &on_save_selected);
MenuItem mnuConfig_mi2("Load Config", &on_load_selected);
MenuItem mnuConfig_mi3("Factory Reset", &on_factory_selected);
MenuItem mnuConfig_mi4("REBOOT", &on_reboot_selected);

Menu mnuAPRS("APRS");

Menu mnu1("WiFi/BT/RF");
MenuItem mnu1_mi1("WiFi AP", &on_wifi_AP_selected);
MenuItem mnu1_mi2("WiFi Client", &on_wifi_Client_selected);
MenuItem mnu1_mi3("Bluetooth", &on_bluetooth_selected);
MenuItem mnu1_mi4("RF Module", &on_rfconfig_selected);

Menu mnu2("IGATE MODE");
MenuItem mnu2_mi1("APRS-IS", &on_aprsserver_selected);
MenuItem mnu2_mi2("Position", &on_igate_position_selected);
MenuItem mnu2_mi3("Function", &on_igate_function_selected);
MenuItem mnu2_mi4("Beacon", &on_igate_beacon_selected);

