nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
Menu mnu3("TRACKER MODE");
MenuItem mnu3_mi1("Position", &on_tracker_position_selected);
MenuItem mnu3_mi2("Function", &on_tracker_function_selected);
MenuItem mnu3_mi3("Option", &on_tracker_option_selected);
MenuItem mnu3_mi4("SmartBeacon", &on_smartbeacon_selected);

Menu mnu4("REPEATER MODE");
MenuItem mnu4_mi1("Position", &on_digi_position_selected);
MenuItem mnu4_mi2("Function", &on_digi_function_selected);
MenuItem mnu4_mi3("Option", &on_digi_option_selected);
// MenuItem mnu4_mi4("Filter", &on_stationbeacon_selected);

Menu mnu5("SYSTEM");
// MenuItem mnu5_mi1("Save/Load", NULL);
MenuItem mnu5_mi2("OLED Display", &on_display_selected);
MenuItem mnu5_mi3("Monitor", &on_filter_selected);

// Menu mu2("CONFIGURATION");
// MenuItem mu2_mi1("WiFi Config", &on_wifi_selected);
// MenuItem mu2_mi2("Station Fix", &on_stationconfig_selected);
// MenuItem mu2_mi3("Smart Beacon", &on_stationbeacon_selected);
// MenuItem mu2_mi4("APRS Server", &on_aprsserver_selected);
// MenuItem mu2_mi5("Filter Display", &on_filter_selected);

// Menu mu6("TNC SETTING");
// MenuItem mu6_mi0("TNC Config", &on_tncconfig_selected);
// MenuItem mu6_mi1("TNC Function", &on_tncfunction_selected);
// MenuItem mu6_mi2("TNC RF Module", &on_rfconfig_selected);
// // MenuItem mu6_mi2("TNC Tracker", &on_tnctracker_selected);
// // MenuItem mu6_mi3("TNC RF Module", &on_rfconfig_selected);
// //  MenuItem mu2_mi5("<--", &on_back_selected);
// Menu mu3("ABOUT");
// MenuItem mu3_mi1("OTA Update", &on_update_selected);
// MenuItem mu3_mi2("WiFi Status", &on_wifistatus_selected);
// MenuItem mu3_mi3("Infomations", &on_infomation_selected);
// MenuItem mu3_mi4("Dash Board", &on_dashboard_selected);
// // MenuItem mu3_mi4("<--", &on_back_selected);
// Menu mu4("SYSTEM");
// MenuItem mu4_mi1("Save Config", &on_save_selected);
// MenuItem mu4_mi2("Load Config", &on_load_selected);
// MenuItem mu4_mi3("Factory Reset", &on_factory_selected);
// MenuItem mu4_mi4("Display Config", &on_display_selected);
// //MenuItem mu4_mi5("Reboot", &on_reboot_selected);
// //MenuItem mu4_mi5()"Reboot", &on_reboot_selected);

// // MenuItem mu4_mi5("Dash Board", &on_system5_selected);
// // MenuItem mu4_mi6("<--", &on_back_selected);
// Menu mu5("TNC CONTROL");
// MenuItem mu5_mi1("nTNC Monitor", &on_tncmonitor_selected);
// MenuItem mu5_mi2("nTNC TX myBeacon", &on_txbeacon_selected);
// MenuItem mu5_mi3("nTNC TX Status", &on_txstatus_selected);

void on_back_selected(MenuItem *p_menu_item)
{
    line = 15;
    ms.back();
    ms.display();
}
// DigoleSerialDisp mydisp = DigoleSerialDisp(8, 9, 10);
// qMenuSystem menu = qMenuSystem(mydisp);

void iconMenuShow(int tab)
{
    if (tab < 1)
        tab = 1;
    if (tab > MAX_MENU)
        tab = MAX_MENU;
    int tabArr = tab - 1;
    // uint8_twifi = 0, i;
    int x;
    String str;
    display.fillRect(0, 16, 128, 48, BLACK);
    display.drawLine(0, 17, 127, 17, 1);

    if (tabArr < 4)
        display.fillRoundRect((tabArr) * 32, 22, 32, 32, 7, 1);
    else
        display.fillRoundRect(96, 22, 32, 32, 7, 1);

    display.fillRect(tabArr * (128 / MAX_MENU), 18, 128 / MAX_MENU, 2, 1);

    uint16_t c = 0;
    for (int i = 0; i < 4; i++)
    {
        if (tabArr < 4)
        {
            if (i == tabArr)
                c = 0;
            else
                c = 1;
            display.drawBitmap(2 + (32 * i), 24, menuList[i].icon, 28, 28, c);
        }
        else
        {
            int idx = i + (tabArr - 3);
            if ((idx + 1) > MAX_MENU)
                break;
            if (idx == tabArr)
                c = 0;
            else
                c = 1;
            display.drawBitmap(2 + (32 * i), 24, menuList[idx].icon, 28, 28, c);
        }
    }

    str = String(menuList[tabArr].name);
    x = str.length() * 6;
    display.setCursor((126 - x) / 2, 57);
    display.print(str);

    // display.drawLine(0, 16, 0, 63, WHITE);
    // display.drawLine(127, 16, 127, 63, WHITE);
    // display.drawLine(0, 63, 127, 63, WHITE);
    // display.fillRect(1, 25, 126, 38, BLACK);
    // display.setTextColor(BLACK);
    // display.setCursor(30, 17);
    // display.print("STATISTICS");
    // display.setCursor(108, 17);
    // display.print("1/5");
    // display.setTextColor(WHITE);

    // display.setCursor(3, 26);
    // display.print("ALL DATA");
    // str = String(status.allCount, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 26);
    // display.print(str);

    // display.setCursor(3, 35);
    // display.print("RF2INET");
    // str = String(status.rf2inet, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 35);
    // display.print(str);

    // display.setCursor(3, 44);
    // display.print("INET2RF");
    // str = String(status.inet2rf, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 44);
    // display.print(str);

    // display.setCursor(3, 53);
    // display.print("ERROR/DROP");
    // str = String(status.errorCount + status.dropCount, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 53);
    // display.print(str);

    display.display();
}

QRCode qrcode;

void drawQrCode(const char *qrStr, const char *lines[])
{
    uint8_t qrcodeData[qrcode_getBufferSize(3)];
    qrcode_initText(&qrcode, qrcodeData, 3, ECC_LOW, qrStr);

    // Text starting point
    int cursor_start_y = 10;
    int cursor_start_x = 4;
    int font_height = 12;

    // QR Code Starting Point
    int offset_x = 62;
    int offset_y = 3;

    display.clearDisplay();

    for (int y = 0; y < qrcode.size; y++)
    {
        for (int x = 0; x < qrcode.size; x++)
        {
            int newX = offset_x + (x * 2);
            int newY = offset_y + (y * 2);

            if (qrcode_getModule(&qrcode, x, y))
            {
                display.fillRect(newX, newY, 2, 2, 0);
            }
            else
            {
                display.fillRect(newX, newY, 2, 2, 1);
            }
        }
    }
    display.setTextColor(1, 0);
    for (int i = 0; i < 4; i++)
    {
        display.setCursor(cursor_start_x, cursor_start_y + font_height * i);
        display.println(lines[i]);
    }
    display.display();
}

const char *MESSAGE_OPEN_WEB_WIFIAP[4] = {"Scan QR", "to open", "browser", "client"};
const char *MESSAGE_OPEN_WEB_WIFICLIENT[4] = {"Scan QR", "to open", "browser", "client"};
const char *MESSAGE_CONFIGURE_WIFI[4] = {"Scan QR", "to setup", "WiFi AP", "connect"};
bool qrcodeActive = false;
bool qrcodeSelect = 0;
void qrcodeDisp()
{
    // Create the QR code
    if (qrcodeActive == true)
        return;
    qrcodeActive = true;
    char link[100];
    if (qrcodeSelect == 0)
    {
        String ip = WiFi.localIP().toString();
        sprintf(link, "http://%s", ip.c_str());
        drawQrCode(link, MESSAGE_OPEN_WEB_WIFICLIENT);
    }
    else
    {
        sprintf(link, "WIFI:S:%s;T:WPA;P:%s;;", config.wifi_ap_ssid, config.wifi_ap_pass);
        drawQrCode(link, MESSAGE_CONFIGURE_WIFI);
    }
}

void statisticsDisp()
{

