nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.display();
}

void gpsDisp()
{
    int x;
    String str;

    if (gps_mode == 0)
    {
        display.fillRect(0, 16, 128, 10, WHITE);
        display.drawLine(0, 16, 0, 63, WHITE);
        display.drawLine(127, 16, 127, 63, WHITE);
        display.drawLine(0, 63, 127, 63, WHITE);
        display.fillRect(1, 25, 126, 38, BLACK);
        display.setTextColor(BLACK);
        display.setCursor(35, 17);
        display.print("GPS INFO");
        // display.setCursor(108, 17);
        // display.print("5/5");
        display.setTextColor(WHITE);

        display.setCursor(3, 26);
        display.print("LAT:");
        str = String(gps.location.lat(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 26);
        display.print(str);

        display.setCursor(3, 35);
        display.print("LON:");
        str = String(gps.location.lng(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 35);
        display.print(str);

        display.drawYBitmap(90, 26, &Icon_TableB[50][0], 16, 16, WHITE);
        display.setCursor(110, 32);
        display.print(gps.satellites.value());

        display.setCursor(3, 44);
        display.print("SPD:");
        str = String(gps.speed.kmph(), 1) + "kph";
        /*x = str.length() * 6;
        display.setCursor(62 - x, 44);*/
        display.print(str);

        display.setCursor(80, 44);
        display.print("ALT:");
        str = String(gps.altitude.meters(), 0) + "m";
        x = str.length() * 6;
        display.setCursor(126 - x, 44);
        display.print(str);

        display.setCursor(3, 54);
        // display.print("TIME:");
        str = String(gps.date.day(), DEC) + "/" + String(gps.date.month(), DEC) + "/" + String(gps.date.year(), DEC);
        display.setCursor(3, 53);
        display.print(str);
        str = String(gps.time.hour(), DEC) + ":" + String(gps.time.minute(), DEC) + ":" + String(gps.time.second(), DEC) + "z";
        x = str.length() * 6;
        display.setCursor(126 - x, 53);
        display.print(str);
    }
    else
    {
        // display.clearDisplay();
        display.fillRect(0, 0, 128, 64, BLACK);
        display.drawYBitmap(90, 0, &Icon_TableB[50][0], 16, 16, WHITE);
        display.setCursor(107, 7);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.print(gps.satellites.value());

        struct tm tmstruct;
        char strTime[10];
        tmstruct.tm_year = 0;
        getLocalTime(&tmstruct, 100);
        sprintf(strTime, "%02d:%02d:%02d", tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        display.setCursor(0, 14);
        display.print(strTime);

        if (config.dim == 2)
        { // Auto dim timeout
            if (millis() > (dimTimeout + 60000))
            {
                display.dim(true);
            }
            else
            {
                display.dim(false);
            }
        }
        else if (config.dim == 3)
        { // Dim for time
            if (hour() > 5 && hour() < 17)
            {
                display.dim(false);
            }
            else
            {
                display.dim(true);
            }
        }

        display.setFont(&FreeSerifItalic9pt7b);
        display.setCursor(80, 28);
        display.printf("km/h");

        display.setFont(&Seven_Segment24pt7b);
        display.setCursor(70, 63);
        display.print(SB_SPEED, DEC);

        compass_label(25, 42, 19, 0.0F, WHITE);
        compass_arrow(25, 42, 16, SB_HEADING, WHITE);
        display.drawLine(0, 16, 60, 16, WHITE);
        display.drawLine(60, 16, 70, 29, WHITE);
        display.drawLine(50, 16, 60, 29, WHITE);
        display.drawLine(60, 29, 127, 29, WHITE);
        display.setFont();
    }
    display.display();
}

void msgBox(String msg)
{
    display.fillRect(30, 26, 68, 28, BLACK);
    display.drawRect(32, 28, 64, 24, WHITE);
    display.drawLine(34, 53, 97, 53, WHITE);
    display.drawLine(97, 30, 97, 53, WHITE);
    display.setCursor(40, 37);
    display.print(msg);
    display.display();
}

uint32_t readADC_Cal(int ADC_Raw)
{
    esp_adc_cal_characteristics_t adc_chars;

    esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, 1100, &adc_chars);
    return (esp_adc_cal_raw_to_voltage(ADC_Raw, &adc_chars));
}

void topBar(int ws)
{
    // int ang = analogRead(39);
    //  float vbat;
    uint8_t vbatScal = 0;
    int wifiSignal = ws;
    uint8_t wifi = 0, i;
    int x, y;
    if (!(config.wifi_mode & WIFI_STA_FIX))
        wifiSignal = -30;
    // display.setTextColor(WHITE);
    display.fillRect(0, 0, 128, 16, BLACK);
    display.drawRoundRect(40, 0, 60, 16, 3, 1);
    // Draw Attena Signal
    display.drawTriangle(0, 0, 6, 0, 3, 3, WHITE);
    display.drawLine(3, 0, 3, 7, WHITE);
    x = 5;
    y = 3;
    wifi = (wifiSignal + 100) / 10;
    if (wifi > 5)
        wifi = 5;
    if (wifi < 0)
        wifi = 0;
    for (i = 0; i < wifi; i++)
    {
        display.drawLine(x, 7 - y, x, 7, WHITE);
        x += 2;
        y++;
    }

    display.setCursor(0, 8);
    if (config.wifi_mode & WIFI_STA_FIX)
    {
        display.print(wifiSignal);
        display.print("dBm");
    }
    else
    {
        display.print("DIS");
    }

    vbat = (float)PMU.getBattVoltage() / 1000;
    // vbatScal=PMU.getBatteryPercent()/20; //100% -> 5 state

    x = 109;
    display.drawLine(0 + x, 1, 2 + x, 1, WHITE);
    display.drawLine(0 + x, 6, 2 + x, 6, WHITE);
    display.drawLine(0 + x, 2, 0 + x, 5, WHITE);
    display.drawLine(2 + x, 0, 18 + x, 0, WHITE);
    display.drawLine(2 + x, 7, 18 + x, 7, WHITE);
    display.drawLine(18 + x, 1, 18 + x, 6, WHITE);
    if (vbat < 3.3)
        vbatScal = 0;
    else
        vbatScal = (uint8_t)ceil((vbat - 3.3) * 6);
    vbatScal += 1;
    // if (vbatScal > 5)
    //     vbatScal = 5;
    x = 16 + 109;
    for (i = 0; i < vbatScal; i++)
    {
        display.drawLine(x, 2, x, 5, WHITE);
        x--;
        display.drawLine(x, 2, x, 5, WHITE);
        x -= 2;
    }
    display.setCursor(104, 8);
    display.print(vbat, 1);
    display.print("V");
    // Wifi Status
    // display.setCursor(15,0);
    // display.print("WiFi");
    if (config.wifi_mode & WIFI_STA_FIX)
    {
        if (WiFi.status() != WL_CONNECTED)
        {
            display.fillRect(15, 0, 24, 8, BLACK);
        }
        else
        {
            display.setCursor(15, 0);
            display.print("WiFi");
        }
    }
    else if (config.wifi_mode & WIFI_AP_FIX)
    {
        display.setCursor(15, 0);
        display.print(" AP");
    }

    if (config.bt_master)
    {
        display.drawBitmap(42, 2, iconBluetooth, 11, 11, 1);
    }
    // DCS Status
    // display.setCursor(50,0);
    //  display.println("DCS");

    if (aprsClient.connected())
    {
        display.drawBitmap(54, 2, iconClound, 12, 12, 1);
    }

