nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    if (gps.location.isValid())
    {
        display.drawBitmap(70, 2, iconLocation, 12, 12, 1);
    }

    if (wireguard_active())
    {
        display.drawBitmap(85, 2, iconLink, 12, 12, 1);
    }

    display.setCursor(110, 0);

    if (config.dim == 2)
    { // Auto dim timeout
        if (millis() > (dimTimeout + 60000))
        {
            display.dim(true);
        }
        else
        {
            display.dim(false);
        }
    }
    else if (config.dim == 3)
    { // Dim for time
        if (hour() > 5 && hour() < 17)
        {
            display.dim(false);
        }
        else
        {
            display.dim(true);
        }
    }

    display.display();
}

uint8_t KeyDelay(uint8_t pin)
{
    int8_t Key = 0;
    int i = 0;
    uint8_t ret = 0;
    do
    {
        delay(1);
        if (digitalRead(pin))
            Key++;
        else
            Key--;
    } while (++i < 10);
    if (Key > 0)
        ret = 1;
    else
        ret = 0;
    return ret;
}

const int8_t KNOBDIR[] = {
    0, -1, 1, 0,
    1, 0, 0, -1,
    -1, 0, 0, 1,
    0, 1, -1, 0};

volatile int8_t _oldState;

volatile long _position;        // Internal position (4 times _positionExt)
volatile long _positionExt;     // External position
volatile long _positionExtPrev; // External position (used only for direction checking)

portMUX_TYPE muxKey = portMUX_INITIALIZER_UNLOCKED;
unsigned long keyPeriadTime;
void IRAM_ATTR doEncoder()
{
    portENTER_CRITICAL_ISR(&muxKey);
    int sig1 = digitalRead(keyA);
    int sig2 = digitalRead(keyB);
    int8_t thisState = sig1 | (sig2 << 1);

    if (_oldState != thisState)
    {
        _position += KNOBDIR[thisState | (_oldState << 2)];
        _oldState = thisState;
        // Serial.printf("Key:%d\n", _position >> 2);
        _positionExt = _position >> 2;
        if (_positionExtPrev != _positionExt)
        {
            if (_positionExtPrev > _positionExt)
            {
                encoder0Pos--;
            }
            else if (_positionExtPrev < _positionExt)
            {
                encoder0Pos++;
            }
            _positionExtPrev = _positionExt;
            // Serial.printf("Key:%d\n", _positionExt);
        }
    }
    portEXIT_CRITICAL_ISR(&muxKey);
}

void displayInfo()
{
    SerialLOG.print(F("Location: "));
    if (gps.location.isValid())
    {
        SerialLOG.print(gps.location.lat(), 6);
        SerialLOG.print(F(","));
        SerialLOG.print(gps.location.lng(), 6);
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.print(F("  Date/Time: "));
    if (gps.date.isValid())
    {
        SerialLOG.print(gps.date.month());
        SerialLOG.print(F("/"));
        SerialLOG.print(gps.date.day());
        SerialLOG.print(F("/"));
        SerialLOG.print(gps.date.year());
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.print(F(" "));
    if (gps.time.isValid())
    {
        if (gps.time.hour() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.hour());
        SerialLOG.print(F(":"));
        if (gps.time.minute() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.minute());
        SerialLOG.print(F(":"));
        if (gps.time.second() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.second());
        SerialLOG.print(F("."));
        if (gps.time.centisecond() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.centisecond());
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.println();
}

// long lastGPS = 0;

unsigned long saveTimeout = 0;
unsigned long menuTimeout = 0;
unsigned long disp_delay = 0;
uint8_t dispMode = 0;
String rawDisp;
int selTab = 0;
bool dispPush = 0;

bool oledLock = 0;

void setOLEDLock(bool lck)
{
    oledLock = lck;
}

extern unsigned long timeGui;

void mainDisp(void *pvParameters)
{
    pinMode(keyA, INPUT_PULLUP);
    pinMode(keyB, INPUT_PULLUP);
    pinMode(keyPush, INPUT_PULLUP);

    conStatNetwork = CON_WIFI;
    conStat = CON_NORMAL;

    // showDisp=false;
    curTab = 3;
    // oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    mnuAbout.add_item(&mnuAbout_mi1);
    mnuAbout.add_item(&mnuAbout_mi2);
    mnuAbout.add_item(&mnuAbout_mi3);
    mnuAbout.add_item(&mnuAbout_mi4);
    mnuConfig.add_item(&mnuConfig_mi1);
    mnuConfig.add_item(&mnuConfig_mi2);
    mnuConfig.add_item(&mnuConfig_mi3);
    mnuConfig.add_item(&mnuConfig_mi4);

    ms.get_root_menu().add_menu(&mnu1); // Wiress
    mnu1.add_item(&mnu1_mi1);
    mnu1.add_item(&mnu1_mi2);
    mnu1.add_item(&mnu1_mi3);
    mnu1.add_item(&mnu1_mi4);

    ms.get_root_menu().add_menu(&mnuAPRS); // APRS

    mnuAPRS.add_menu(&mnu2);
    mnu2.add_item(&mnu2_mi1);
    mnu2.add_item(&mnu2_mi2);
    mnu2.add_item(&mnu2_mi3);
    mnu2.add_item(&mnu2_mi4);

    mnuAPRS.add_menu(&mnu3);
    mnu3.add_item(&mnu3_mi1);
    mnu3.add_item(&mnu3_mi2);
    mnu3.add_item(&mnu3_mi3);
    mnu3.add_item(&mnu3_mi4);

    mnuAPRS.add_menu(&mnu4);
    mnu4.add_item(&mnu4_mi1);
    mnu4.add_item(&mnu4_mi2);
    mnu4.add_item(&mnu4_mi3);

    ms.get_root_menu().add_menu(&mnu5); // SYSTEM
    mnu5.add_menu(&mnuConfig);
    mnu5.add_item(&mnu5_mi2);
    mnu5.add_item(&mnu5_mi3);
    mnu5.add_menu(&mnuAbout);

    attachInterrupt(keyA, doEncoder, CHANGE);
    attachInterrupt(keyB, doEncoder, CHANGE);

    if (config.startup > 5)
        config.startup = 0;
    if (config.startup < 5)
    {
        curTab = config.startup + 1;
        gps_mode = 0;
    }
    else
    {
        curTab = 5;
        gps_mode = 1;
    }
    topBar(-1);

    if (config.igate_gps == false)
    {
        tx_counter = 0;
        tx_interval = 10;
    }

    unsigned long timeGuiOld = millis();
    timeGui = 0;
    saveTimeout = millis();
    char curTabOld = 0;
    uint8_t menuSel = 0;
    for (;;)
    {
        unsigned long now = millis();
        timeGui = now - timeGuiOld;
        timeGuiOld = now;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        // Prevent RF interference with OLED
        if (oledLock == true)
            continue;
        if (getTransmit())
        {
            delay(1000);
            continue;
        }

