nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
        if (millis() > (saveTimeout + 300000))
        {
            powerSave();
        }

        if (conStat == CON_NORMAL)
        {
            menuTimeout = millis();
            if ((raw_count > 0) && (disp_delay == 0))
            {
                saveTimeout = millis();
                dispPush = false;
                int idx = 0;
                if (popTNC2Raw(idx) > -1)
                {
                    pkgListType pkg = getPkgList(idx);
                    rawDisp = String(pkg.raw);
                    dispWindow(rawDisp, dispMode, true);
                    selTab = idx;
                    if (menuSel == 0) curTabOld = curTab+1;
                }
                // selTab = 1;
            }

            // if (!getTransmit())
            // {
            if (dispFlagTX == 1)
            {
                dispTX(1);
                dispFlagTX = 0;
            }
            else if (dispFlagTX == 2)
            {
                dispTX(0);
                dispFlagTX = 0;
            }
            //}

            if (millis() > (unsigned long)timeHalfSec)
            {
                timeHalfSec = millis() + 500 + disp_delay;
                // powerWakeup();
                disp_delay = 0;
                dispMode = 0;
                // dispFlagTX=0;
                if (powerStatus() && (raw_count == 0))
                {
                    // if (!(menuSel == 2 && gps_mode == 1))
                    if (menuSel == 0 || menuSel == 1 || menuSel == 4)
                        topBar(WiFi.RSSI());
                    if (menuSel == 0)
                    {
                        if (curTab != curTabOld)
                        {
                            iconMenuShow(curTab);
                            curTabOld = curTab;
                        }
                    }
                    else if (menuSel == 1)
                    {
                        statisticsDisp();
                    }
                    else if (menuSel == 2)
                    {
                        if (!gps_mode == 1)
                            topBar(WiFi.RSSI());
                        gpsDisp();
                    }
                    else if (menuSel == 4)
                    {
                        systemDisp();
                    }
                    else if (menuSel == 5)
                    {
                        conStat = CON_MENU;
                        ms.reset();
                        ms.display();
                    }
                    else if (menuSel == 6)
                    {
                        qrcodeDisp();
                    }
                    else
                    {
                        menuSel = 0;
                    }
                }
            }
            else if (disp_delay > 0)
            {
                if (encoder0Pos != posNow)
                {

                    saveTimeout = millis();
                    pkgListType pkg = getPkgList(selTab);
                    if (config.dim == 2)
                        dimTimeout = millis();
                    if (encoder0Pos > posNow)
                    {
                        selTab++;
                        for (; selTab < PKGLISTSIZE; selTab++)
                        {
                            if (pkg.time > 0)
                                break;
                        }
                        if (selTab >= PKGLISTSIZE)
                            selTab = 0;
                    }
                    else
                    {
                        selTab--;
                        for (; selTab >= 0; selTab--)
                        {
                            if (pkg.time > 0)
                                break;
                        }
                        if (selTab < 0)
                            selTab = PKGLISTSIZE - 1;
                    }
                    posNow = encoder0Pos;

                    if (pkg.time > 0)
                    {
                        rawDisp = String(pkg.raw);
                        dispWindow(rawDisp, dispMode, false);
                    }
                }
            }

            if (raw_count == 0)
            {
                if (encoder0Pos != posNow)
                {
                    timeHalfSec = 0;
                    powerWakeup();
                    saveTimeout = millis();
                    if (config.dim == 2)
                        dimTimeout = millis();
                    if (encoder0Pos > posNow)
                    {
                        curTab++;
                        if (curTab > MAX_MENU)
                            curTab = MAX_MENU;
                    }
                    else
                    {
                        curTab--;
                        if (curTab < 1)
                            curTab = 1;
                    }
                    posNow = encoder0Pos;
                }
            }
        }

        if ((digitalRead(keyPush) == LOW) && (conStat != CON_MENU))
        {
            saveTimeout = millis();
            powerWakeup();
            currentTime = millis();
            delay(500);
            // conStat = CON_MENU;
            // TaskGPS.Enable(false);
            if (digitalRead(keyPush) == HIGH)
            { // ONE Click
                if (config.dim == 2)
                    dimTimeout = millis();
                if (disp_delay > 0)
                { // Select MODE Decode/RAW
                    dispPush = false;
                    disp_delay = config.dispDelay * 1000;
                    timeHalfSec = millis() + disp_delay;
                    if (dispMode == 0)
                        dispMode = 1;
                    else
                        dispMode = 0;
                    dispWindow(rawDisp, dispMode, false);
                }
                else
                {
                    if (menuSel == 0)
                    {
                        menuSel = curTab;
                    }
                    else
                    {
                        menuSel = 0;
                        curTabOld = curTab + 1; // Refresh windows first
                        qrcodeActive = false;
                    }
                }
            }
            // ms.reset();
            // ms.display();
            while (digitalRead(keyPush) == LOW)
            {
                delay(10);
                if ((millis() - currentTime) > 2000)
                {
                    if (menuSel == 2) // GPS switch info/speed
                    {
                        if (gps_mode == 0)
                            gps_mode = 1;
                        else
                            gps_mode = 0;
                    }
                    else if (menuSel == 6) // qrcode switch web/wifi
                    {
                        if (qrcodeSelect == 0)
                            qrcodeSelect = 1;
                        else
                            qrcodeSelect = 0;
                        qrcodeActive = false;
                    }
                    // if ((curTab == 2 || curTab == 3)&& disp_delay>0) {
                    if (disp_delay > 0)
                    {
                        dispPush = true;
                        disp_delay = 600 * 1000;
                        dispWindow(rawDisp, dispMode, false);
                    }
                    else
                    {
                        // conStat = CON_MENU;
                        // // TaskGPS.Enable(false);

                        // ms.reset();
                        // ms.display();

                        // TaskGPS.Enable(true);
                    }
                    break;
                }
            };
            while (digitalRead(keyPush) == LOW)
                delay(10);
        }

        if (conStat == CON_MENU)
        {
            delay(10);
            if (millis() > (menuTimeout + 60000L))
            {
                menuTimeout = millis();
                conStat = CON_NORMAL;
                powerSave();
            }

            if (encoder0Pos != posNow)
            {
                saveTimeout = millis();
                menuTimeout = millis();
                line = 15; // line variable reset
                if (encoder0Pos > posNow)
                {
                    ms.next();
                    // ms.display();
                }
                else
                {
                    ms.prev();
                    // ms.display();
                }
                ms.display();
                posNow = encoder0Pos;
            }
            else
            {
                if ((digitalRead(keyPush) == LOW))
                {
                    saveTimeout = millis();
                    menuTimeout = millis();
                    currentTime = millis();
                    line = 15; // line variable reset
                    while (digitalRead(keyPush) == LOW)
                    {
                        delay(10);
                        if ((millis() - currentTime) > 1500)
                            break;
                    };
                    if ((millis() - currentTime) > 1000)
                    {
                        if (!ms.back())
                        {
                            conStat = CON_NORMAL;
                            menuSel = 0;
                            curTabOld = curTab + 1; // Refresh windows first
                        }
                    }
                    else
                    {
                        ms.select();
                    }
                    ms.display();
                    while (digitalRead(keyPush) == LOW)
                    {
                        delay(10);
                    }
                    menuTimeout = millis();
                }
            }
            // ms.display();
        }
    }
}

// Routine
void line_angle(signed int startx, signed int starty, unsigned int length, unsigned int angle, unsigned int color)
{
    display.drawLine(startx, starty, (startx + length * cosf(angle * 0.017453292519)), (starty + length * sinf(angle * 0.017453292519)), color);
}

int xSpiGlcdSelFontHeight = 8;
int xSpiGlcdSelFontWidth = 5;

void compass_label(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angleNew;
    // ushort Color[2];
    uint8_t x_N, y_N, x_S, y_S;
    int x[4], y[4], i;
    int xOffset, yOffset;
    yOffset = (xSpiGlcdSelFontHeight / 2);
    xOffset = (xSpiGlcdSelFontWidth / 2);
    // GLCD_WindowMax();
    angle += 270.0F;
    angleNew = angle;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x[i] = startx + (length * cosf(angleNew * 0.017453292519));
        y[i] = starty + (length * sinf(angleNew * 0.017453292519));
        x[i] -= xOffset;
        y[i] -= yOffset;
        angleNew += 90.0F;
    }
    angleNew = angle + 45.0F;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x_S = startx + ((length - 3) * cosf(angleNew * 0.017453292519));
        y_S = starty + ((length - 3) * sinf(angleNew * 0.017453292519));
        x_N = startx + ((length + 3) * cosf(angleNew * 0.017453292519));
        y_N = starty + ((length + 3) * sinf(angleNew * 0.017453292519));
        angleNew += 90.0F;
        display.drawLine(x_S, y_S, x_N, y_N, color);
    }
    display.drawCircle(startx, starty, length, color);
    display.setFont();
    display.drawChar((uint8_t)x[0], (uint8_t)y[0], 'N', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[1], (uint8_t)y[1], 'E', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[2], (uint8_t)y[2], 'S', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[3], (uint8_t)y[3], 'W', WHITE, BLACK, 1);
}

void compass_arrow(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angle1, angle2;
    int xdst, ydst, x1sta, y1sta, x2sta, y2sta;
    int length2 = length / 2;
    angle += 270.0F;
    if (angle > 360.0F)
        angle -= 360.0F;
    xdst = startx + length * cosf(angle * 0.017453292519);
    ydst = starty + length * sinf(angle * 0.017453292519);
    angle1 = angle + 135.0F;
    if (angle1 > 360.0F)
        angle1 -= 360.0F;
    angle2 = angle + 225.0F;
    if (angle2 > 360.0F)
        angle2 -= 360.0F;
    x1sta = startx + length2 * cosf(angle1 * 0.017453292519);
    y1sta = starty + length2 * sinf(angle1 * 0.017453292519);
    x2sta = startx + length2 * cosf(angle2 * 0.017453292519);
    y2sta = starty + length2 * sinf(angle2 * 0.017453292519);
    display.drawLine(startx, starty, xdst, ydst, color);
    display.drawLine(xdst, ydst, x1sta, y1sta, color);
    display.drawLine(x1sta, y1sta, startx, starty, color);
    display.drawLine(startx, starty, x2sta, y2sta, color);
    display.drawLine(x2sta, y2sta, xdst, ydst, color);
}

